Revit 2024 API
NonContinuousRailStructure.GetNonContinuousRail Method
 Gets the Non-Continuous Rail object of specified index from the Rail Structure.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public NonContinuousRailInfo GetNonContinuousRail(
	int index
)
Visual Basic
Public Function GetNonContinuousRail ( _
	index As Integer _
) As NonContinuousRailInfo
Visual C++
public:
NonContinuousRailInfo^ GetNonContinuousRail(
	int index
)
Parameters
index
Type: System.Int32
 Non-Continuous Rail index.
Return Value
 The requested object handle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The index index is out of range.
See Also
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace